artillery.yml
config: 
  target: "http://localhost:9002"
  http:
    pool: 5
  phases:
    # - duration: 10
    #   arrivalRate: 10
    #   name: Warm up
    # - duration: 60
    #   arrivalRate: 10
    #   rampTo: 25
    #   name: Ramp up load
    - duration: 60
      arrivalRate: 100
      name: Sustained load
    
scenarios:
    - flow:
        - loop:
            - get:
                url: "/qa/5f8f13207f4286946c79e508"
            # - post:
            #     url: "/qa/5f8f13207f4286946c79e508"
          count: 10