artillery.yml
config: 
  target: "http://localhost:9002"
  http:
    pool: 10
  phases:
    # - duration: 10
    #   arrivalRate: 10
    #   name: Warm up
    # - duration: 60
    #   arrivalRate: 10
    #   rampTo: 25
    #   name: Ramp up load
    - duration: 60
      arrivalRate: 20
      name: Sustained load
    
scenarios:
    - flow:
        - loop:
            - get:
                url: "/qa/5f8f13217f4286946c79f912"
          count: 200